{"body": "h2. Help on replication\n\nAs of !TapirWiki 0.2, replication is supported through the wiki UI. However, it is disabled by default. Replication *{color:red}needs testing and may contain bugs or simply not work as you expect*. Please let me know if this is the case by raising an issue http://code.google.com/p/tapirwiki\n\nh3. Enable replication\n\nEnabling replication requires editing the TAPIRWIKISETTINGS document.\n\n* Open Futon (http://hostname:5984/_utils/)\n* Open the database containing your wiki (e.g. 'wiki')\n* Open the TAPIRWIKISETTINGS document - this contains a number of settings for the wiki\n* change the 'replicationEnabled' field to true\n* change the 'replicationEndPoint' field to be a URL to the central node in your wiki (e.g. 'http://remotehost:5984/wiki')\n* Save the changes to the document and refresh your wiki\n\nIf the changes are successful, a new \"Synchronise\" button should appear in the wiki navigation menu (top left). \n\nNote : The synchronise button will not be show if you are viewing the wiki from the URL of the replicationEndPoint. For example, if you are browsing the wiki at http://remotehost:5984/wiki, the button will not be shown.\n\nh3. How replication works\n\nThe replication in !TapirWiki is a thin layer over the support for replication provided by CouchDB. When you press the synchronise button, the following occurs:\n\n* The remote wiki's changes are replicated to your local wiki\n* Your local wiki's changes are replicated to the remote wiki\n\nReplication only transfers the latest version of any page, so if you have a page which you have edited a lot on one computer, the historic version of the pages will remain on that computer - only the latest will be synchronised.\n\nh3. Conflicts\n\nConflicts occur when two or more changes are made to the same wiki page on two different instances. Any conflicts which occur should be visible through the page history. You can view the conflicting edit form here, and if you wish this version to become the most recent again, you can simply edit from that point. ", "edited_by": "Nobody", "edited_on": "Tue Nov 24 2009 20:03:14 GMT+0000 (GMT)", "_id": "HelpOnReplication", "type": "page"}

